-- phpMyAdmin SQL Dump
-- version 4.3.11
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Авг 09 2015 г., 12:33
-- Версия сервера: 5.6.23-log
-- Версия PHP: 5.6.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `fan_log`
--

-- --------------------------------------------------------

--
-- Структура таблицы `p1_messages`
--

CREATE TABLE IF NOT EXISTS `p1_messages` (
  `id` int(11) NOT NULL,
  `elem_id` varchar(100) DEFAULT NULL,
  `date_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `fan_number` varchar(100) NOT NULL,
  `message` varchar(240) NOT NULL,
  `status` varchar(100) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=1387 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `p1_messages`
--

INSERT INTO `p1_messages` (`id`, `elem_id`, `date_time`, `fan_number`, `message`, `status`) VALUES
(1192, 'polzun', '2015-08-09 00:34:49', 'П2', 'Уставка зменена до 40<strong><sup>0</sup></strong> С:Изменение уставки', 'uncheked'),
(1193, 'fish', '2015-08-09 00:34:51', 'П2', 'Скорость вентилятора изменена до 50 %.:Изменение скорости вентилятора', 'uncheked'),
(1194, 'start', '2015-08-09 00:36:51', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1195, 'stop', '2015-08-09 00:37:12', 'П2', 'Установка остановлена : Остановка установки', 'uncheked'),
(1197, 'start', '2015-08-09 00:55:09', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1198, 'FAIL_FAN_BTN', '2015-08-09 00:55:26', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1199, 'RESET', '2015-08-09 00:55:31', 'П2', 'Сброс в состояние - зима', 'uncheked'),
(1200, 'start', '2015-08-09 00:56:10', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1201, 'stop', '2015-08-09 00:56:22', 'П2', 'Установка остановлена : Остановка установки', 'uncheked'),
(1202, 'start', '2015-08-09 00:56:36', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1205, 'start', '2015-08-09 08:08:15', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1206, 'FAIL_FAN_BTN', '2015-08-09 08:08:25', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1209, 'start', '2015-08-09 08:13:20', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1244, 'start', '2015-08-09 08:55:39', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1248, 'start', '2015-08-09 09:03:07', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1249, 'start', '2015-08-09 09:03:49', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1250, 'start', '2015-08-09 09:05:15', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1251, 'start', '2015-08-09 09:06:23', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1252, 'start', '2015-08-09 09:06:53', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1253, 'start', '2015-08-09 09:08:27', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1282, 'start', '2015-08-09 09:50:59', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1293, 'start', '2015-08-09 10:04:56', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1297, 'start', '2015-08-09 10:11:26', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1320, 'start', '2015-08-09 11:29:52', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1321, 'start', '2015-08-09 11:31:40', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1322, 'stop', '2015-08-09 11:33:16', 'П2', 'Установка остановлена : Остановка установки', 'uncheked'),
(1323, 'start', '2015-08-09 11:34:02', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1324, 'stop', '2015-08-09 11:34:10', 'П2', 'Установка остановлена : Остановка установки', 'uncheked'),
(1336, 'start', '2015-08-09 11:47:31', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1337, 'FAIL_FAN_BTN', '2015-08-09 11:47:39', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1338, 'start', '2015-08-09 11:48:33', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1339, 'FAIL_FAN_BTN', '2015-08-09 11:48:39', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1340, 'start', '2015-08-09 11:49:28', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1341, 'FAIL_FAN_BTN', '2015-08-09 11:49:32', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1354, 'start', '2015-08-09 12:10:06', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1355, 'FAIL_FAN_BTN', '2015-08-09 12:10:12', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1358, 'start', '2015-08-09 12:32:12', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1359, 'FAIL_FAN_BTN', '2015-08-09 12:32:17', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1360, 'start', '2015-08-09 12:34:30', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1361, 'FAIL_FAN_BTN', '2015-08-09 12:34:34', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1362, 'start', '2015-08-09 12:34:58', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1363, 'FAIL_F_BTN', '2015-08-09 12:35:05', 'П2', 'АВАРИЯ ФИЛЬТРА. Установка «СТОП»', 'uncheked'),
(1364, 'FAIL_FAN_BTN', '2015-08-09 12:35:08', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1365, 'start', '2015-08-09 12:35:39', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1366, 'FAIL_FREEZ_BTN', '2015-08-09 12:35:43', 'П2', 'АВАРИЯ ЗАМОРОЗКА. Установка «СТОП»', 'uncheked'),
(1367, 'start', '2015-08-09 12:36:30', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1368, 'FAIL_FAN_BTN', '2015-08-09 12:36:33', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1371, 'start', '2015-08-09 12:40:16', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1372, 'FAIL_F_BTN', '2015-08-09 12:40:20', 'П2', 'АВАРИЯ ФИЛЬТРА. Установка «СТОП»', 'uncheked'),
(1373, 'start', '2015-08-09 12:42:13', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1374, 'FAIL_FAN_BTN', '2015-08-09 12:42:20', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1375, 'start', '2015-08-09 12:43:27', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1376, 'FAIL_FAN_BTN', '2015-08-09 12:43:31', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1377, 'start', '2015-08-09 12:43:53', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1378, 'FAIL_FAN_BTN', '2015-08-09 12:43:57', 'П2', 'АВАРИЯ ВЕНТИЛЯТОРА. Установка «СТОП»', 'uncheked'),
(1379, 'start', '2015-08-09 12:47:05', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1380, 'start', '2015-08-09 12:48:05', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1381, 'stop', '2015-08-09 12:48:40', 'П2', 'Установка остановлена : Остановка установки', 'uncheked'),
(1382, 'start', '2015-08-09 12:49:39', 'П2', 'Установка запущена:Запуск установки', 'uncheked'),
(1383, 'stop', '2015-08-09 12:49:48', 'П2', 'Установка остановлена : Остановка установки', 'uncheked'),
(1384, 'start', '2015-08-09 13:18:56', 'П1', 'Установка запущена:Запуск установки', 'uncheked'),
(1385, 'FAIL_VALVE_BTN', '2015-08-09 13:19:02', 'П1', 'АВАРИЯ ЗАСЛОНКА. Установка «СТОП»', 'uncheked'),
(1386, 'start', '2015-08-09 13:19:17', 'П2', 'Установка запущена:Запуск установки', 'uncheked');

-- --------------------------------------------------------

--
-- Структура таблицы `p1_value`
--

CREATE TABLE IF NOT EXISTS `p1_value` (
  `id_val` int(11) NOT NULL,
  `fan_number` varchar(100) NOT NULL,
  `d_t` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'Время последнего изменения',
  `VEL_IND` int(11) DEFAULT NULL,
  `SET_IND` int(11) DEFAULT NULL,
  `TE2` int(11) DEFAULT NULL,
  `TE3` int(11) DEFAULT NULL,
  `TE1` int(11) DEFAULT NULL,
  `INC_NUM` int(11) DEFAULT NULL,
  `WATERBACK_IND` int(11) DEFAULT NULL
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `p1_value`
--

INSERT INTO `p1_value` (`id_val`, `fan_number`, `d_t`, `VEL_IND`, `SET_IND`, `TE2`, `TE3`, `TE1`, `INC_NUM`, `WATERBACK_IND`) VALUES
(4, 'П1', '2015-08-04 20:54:59', 15, 2, 67, 56, -10, 12, 31),
(5, 'П2', '2015-08-08 21:32:29', 50, 40, 32, 77, 2, NULL, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `p1_messages`
--
ALTER TABLE `p1_messages`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `p1_value`
--
ALTER TABLE `p1_value`
  ADD PRIMARY KEY (`id_val`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `p1_messages`
--
ALTER TABLE `p1_messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=1387;
--
-- AUTO_INCREMENT для таблицы `p1_value`
--
ALTER TABLE `p1_value`
  MODIFY `id_val` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=6;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
