<?php
echo' Прошу реализовать ТЗ (во вложении) посредством любой программной технологии,
 *  с сохранением результатов в любое хранилище (с созданием обнуляемой истории 
 * событий).

1) Разместить выполненное задание на бесплатном хостинге.
2) Описать достижения (документировать)
3) Предоставить исходный код мне для анализа (комментарии пришлю)

С уважением, 
Владимир Иванов,
инженер по развитию.
Группа компаний Санлайн.

http://www.sunline-stroy.ru

Мобильный
+7-904-6002015
+7-981-7921801

Рабочий
+7 (812) 740-75-47
';


/* 
 Прошу реализовать ТЗ (во вложении) посредством любой программной технологии,
 *  с сохранением результатов в любое хранилище (с созданием обнуляемой истории 
 * событий).

1) Разместить выполненное задание на бесплатном хостинге.
2) Описать достижения (документировать)
3) Предоставить исходный код мне для анализа (комментарии пришлю)

С уважением, 
Владимир Иванов,
инженер по развитию.
Группа компаний Санлайн.

http://www.sunline-stroy.ru

Мобильный
+7-904-6002015
+7-981-7921801

Рабочий
+7 (812) 740-75-47

 */

